package lesson5;

public class Arrays1 {
    public static void main(String[] args) {
        //Написать программу, удаляющую все повторяющиеся целые числа из массива и печатающую результат.
        // Массив должен использоваться тот же самый. На место удаленных элементов ставить цифру 0.
//        int [] array = {1, 2, 5, 6, 2, 5};
//        int uniqueCount = 0;
//        for (int i = 0; i < args.length; i++)
//        Не поняла как делать это задание, пыталась самостоятельно разобраться, не получилась


//        Напишите программу, которая циклически сдвигает элементы массива вправо на одну позицию, и печатает результат.
//        Цикличность означает, что последний элемент массива становится самым первым его элементом.

    }
}
